maven_test1/src/main/api/833cbf80-3150-11e6-a752-507920524153.1465813255032.Sterling Input_Update_Consignment.txt


<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.rpc.webservices.services.interop.yantra.com"><soapenv:Header/><soapenv:Body><ejb:msUpdateConsignmentSync soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><env><![CDATA[<YFSEnvironment userId="admin" ProgId="admin"/>]]></env><document1><![CDATA[<MultiApi><API Name="manageLoad"><Input><Loads><Load Action="Modify" StoreID="0165" LoadKey="2016-06-10_0165_EXT_BOSS201708567"><Extn UserID="16183906_S0165" ProcessedFrom=".com+"/><LoadShipments><LoadShipment Action="Delete" ShipmentKey="201606082017084629426491"/></LoadShipments></Load><Load Action="Modify" LoadNo="DelayedConsignment_0165"><LoadShipments><LoadShipment Action="" ShipmentKey="201606082017084629426491"/></LoadShipments></Load></Loads></Input></API><API FlowName="MSChangeLoadStatusWrapperService"><Input><Load LoadKey="2016-06-10_0165_EXT_BOSS201708567" EnterpriseCode="MS_UK" UserID="16183906_S0165" StoreID="0165" BaseDropStatus="1300.100" TransactionId="PROCESS_CONSIGNMENT.1001.ex"/></Input></API></MultiApi>]]></document1></ejb:msUpdateConsignmentSync></soapenv:Body></soapenv:Envelope>


<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.rpc.webservices.services.interop.yantra.com"><soapenv:Header/><soapenv:Body><ejb:msUpdateConsignmentSync soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><env><![CDATA[<YFSEnvironment userId="admin" ProgId="admin"/>]]></env><document1><![CDATA[<MultiApi><API Name="manageLoad"><Input><Loads><Load Action="Modify" StoreID="0165" LoadKey="2016-06-10_0165_EXT_BOSS201504573"><Extn UserID="16183906_S0165" ProcessedFrom=".com+"/><LoadShipments><LoadShipment Action="Delete" ShipmentKey="201606082015044629386293"/></LoadShipments></Load><Load Action="Modify" LoadNo="DelayedConsignment_0165"><LoadShipments><LoadShipment Action="" ShipmentKey="201606082015044629386293"/></LoadShipments></Load></Loads></Input></API><API FlowName="MSChangeLoadStatusWrapperService"><Input><Load LoadKey="2016-06-10_0165_EXT_BOSS201504573" EnterpriseCode="MS_UK" UserID="16183906_S0165" StoreID="0165" BaseDropStatus="1300.100" TransactionId="PROCESS_CONSIGNMENT.1001.ex"/></Input></API></MultiApi>]]></document1></ejb:msUpdateConsignmentSync></soapenv:Body></soapenv:Envelope>


<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.rpc.webservices.services.interop.yantra.com"><soapenv:Header/><soapenv:Body><ejb:msUpdateConsignmentSync soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><env><![CDATA[<YFSEnvironment userId="admin" ProgId="admin"/>]]></env><document1><![CDATA[<MultiApi><API Name="manageLoad"><Input><Loads><Load Action="Modify" StoreID="0165" LoadKey="2016-06-09_0165_EXT_BOSS201832620"><Extn UserID="16183906_S0165" ProcessedFrom=".com+"/><LoadShipments><LoadShipment Action="Delete" ShipmentKey="201606072018324611597680"/></LoadShipments></Load><Load Action="Modify" LoadNo="DelayedConsignment_0165"><LoadShipments><LoadShipment Action="" ShipmentKey="201606072018324611597680"/></LoadShipments></Load></Loads></Input></API><API FlowName="MSChangeLoadStatusWrapperService"><Input><Load LoadKey="2016-06-09_0165_EXT_BOSS201832620" EnterpriseCode="MS_UK" UserID="16183906_S0165" StoreID="0165" BaseDropStatus="1300.100" TransactionId="PROCESS_CONSIGNMENT.1001.ex"/></Input></API></MultiApi>]]></document1></ejb:msUpdateConsignmentSync></soapenv:Body></soapenv:Envelope>


<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.rpc.webservices.services.interop.yantra.com"><soapenv:Header/><soapenv:Body><ejb:msUpdateConsignmentSync soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><env><![CDATA[<YFSEnvironment userId="admin" ProgId="admin"/>]]></env><document1><![CDATA[<MultiApi><API Name="manageLoad"><Input><Loads><Load Action="Modify" StoreID="0165" LoadKey="2016-06-09_0165_EXT_BOSS201740991"><Extn UserID="16183906_S0165" ProcessedFrom=".com+"/><LoadShipments><LoadShipment Action="Delete" ShipmentKey="201606072017414611577498"/></LoadShipments></Load><Load Action="Modify" LoadNo="DelayedConsignment_0165"><LoadShipments><LoadShipment Action="" ShipmentKey="201606072017414611577498"/></LoadShipments></Load></Loads></Input></API><API FlowName="MSChangeLoadStatusWrapperService"><Input><Load LoadKey="2016-06-09_0165_EXT_BOSS201740991" EnterpriseCode="MS_UK" UserID="16183906_S0165" StoreID="0165" BaseDropStatus="1300.100" TransactionId="PROCESS_CONSIGNMENT.1001.ex"/></Input></API></MultiApi>]]></document1></ejb:msUpdateConsignmentSync></soapenv:Body></soapenv:Envelope>



<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.rpc.webservices.services.interop.yantra.com"><soapenv:Header/><soapenv:Body><ejb:msUpdateConsignmentSync soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><env><![CDATA[<YFSEnvironment userId="admin" ProgId="admin"/>]]></env><document1><![CDATA[<MultiApi><API Name="manageLoad"><Input><Loads><Load Action="Modify" StoreID="0165" LoadKey="2016-06-10_0165_EXT_BOSS201840334"><Extn UserID="16183906_S0165" ProcessedFrom=".com+"/><LoadShipments><LoadShipment Action="Delete" ShipmentKey="201606082018404629458648"/></LoadShipments></Load><Load Action="Modify" LoadNo="DelayedConsignment_0165"><LoadShipments><LoadShipment Action="" ShipmentKey="201606082018404629458648"/></LoadShipments></Load></Loads></Input></API><API FlowName="MSChangeLoadStatusWrapperService"><Input><Load LoadKey="2016-06-10_0165_EXT_BOSS201840334" EnterpriseCode="MS_UK" UserID="16183906_S0165" StoreID="0165" BaseDropStatus="1300.100" TransactionId="PROCESS_CONSIGNMENT.1001.ex"/></Input></API></MultiApi>]]></document1></ejb:msUpdateConsignmentSync></soapenv:Body></soapenv:Envelope>


<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.rpc.webservices.services.interop.yantra.com"><soapenv:Header/><soapenv:Body><ejb:msUpdateConsignmentSync soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><env><![CDATA[<YFSEnvironment userId="admin" ProgId="admin"/>]]></env><document1><![CDATA[<MultiApi><API Name="manageLoad"><Input><Loads><Load Action="Modify" StoreID="0165" LoadKey="2016-06-13_0165_EXT_BOSS201654906"><Extn UserID="16183906_S0165" ProcessedFrom=".com+"/><LoadShipments><LoadShipment Action="Delete" ShipmentKey="201606082016544629421455"/></LoadShipments></Load><Load Action="Modify" LoadNo="DelayedConsignment_0165"><LoadShipments><LoadShipment Action="" ShipmentKey="201606082016544629421455"/></LoadShipments></Load></Loads></Input></API><API FlowName="MSChangeLoadStatusWrapperService"><Input><Load LoadKey="2016-06-13_0165_EXT_BOSS201654906" EnterpriseCode="MS_UK" UserID="16183906_S0165" StoreID="0165" BaseDropStatus="1300.100" TransactionId="PROCESS_CONSIGNMENT.1001.ex"/></Input></API></MultiApi>]]></document1></ejb:msUpdateConsignmentSync></soapenv:Body></soapenv:Envelope>